dwgan/STKNX_ChargeStation/source/cpus/STM32F10XX/include/stm32f10xx_rcc.h
/******************************************************************************
* File       : rcc.h
* Function   : Reset and clock control
* description: Realise the system clock configuration.
*              *NOTE*: Extern crystal frequency should be defined in Boardctrl.h 
* Version    : V1.00
* Author     : Ian
* Date       : 30th Jul 2016
* History    :  No.  When           Who           What
*               1    30/Jul/2016    Ian           Create
******************************************************************************/


#ifndef _RCC_H_
#define _RCC_H_

#ifdef __cplusplus
extern "C" {
#endif

/* Check if the max AHB clock is defined or NOT */
#ifndef MAX_AHB_CLK_IN_MHZ
#if defined(__STM32F103)
#define MAX_AHB_CLK_IN_MHZ                   (72)                              /* 72MHz is the max AHB clock for STM32F103  */
#elif defined(__STM32101)
#define MAX_AHB_CLK_IN_MHZ                   (36)                              /* 36MHz is the max AHB clock for STM32F101  */
#else
#define MAX_AHB_CLK_IN_MHZ                   (36)                              /* 36MHz is the max AHB clock for the others */
#endif
#endif

#define RCC_BASE                             ((T_RCC_MEM_MAP)0x40021000U)      /* Address of RCC base register */

#define RCC_CR                               (RCC_BASE->CR)                    /* Address of clock control register   */
#define RCC_CFGR                             (RCC_BASE->CFGR)                  /* Address of clock configure register */
#define RCC_CIR                              (RCC_BASE->CIR)                   /* Address of clock interrupt register */
#define RCC_APB2RSTR                         (RCC_BASE->APB2RSTR)              /* Address of APB2 reset register      */
#define RCC_APB1RSTR                         (RCC_BASE->APB1RSTR)              /* Address of APB1 reset register      */
#define RCC_AHBENR                           (RCC_BASE->AHBENR)                /* Address of AHB enable register      */
#define RCC_APB2ENR                          (RCC_BASE->APB2ENR)               /* Address of APB2 enable register     */
#define RCC_APB1ENR                          (RCC_BASE->APB1ENR)               /* Address of APB1 enable register     */
#define RCC_BDCR                             (RCC_BASE->BDCR)                  /* Address of backup control register  */
#define RCC_CSR                              (RCC_BASE->CSR)                   /* Address of control/status register  */

#define RCC_CR_DEFAULT_VAL                   (0x00000083U)                     /* Default value of clock control register   */
#define RCC_CFGR_DEFAULT_VAL                 (0x00000000U)                     /* Default value of clock configure register */
#define RCC_CIR_DEFAULT_VAL                  (0x00000000U)                     /* Default value of clock interrupt register */
#define RCC_APB2RSTR_DEFAULT_VAL             (0x00000000U)                     /* Default value of APB2 reset register      */
#define RCC_APB1RSTR_DEFAULT_VAL             (0x00000000U)                     /* Default value of APB1 reset register      */
#define RCC_AHBENR_DEFAULT_VAL               (0x00000014U)                     /* Default value of AHB enable register      */
#define RCC_APB2ENR_DEFAULT_VAL              (0x00000000U)                     /* Default value of APB2 enable register     */
#define RCC_APB1ENR_DEFAULT_VAL              (0x00000000U)                     /* Default value of APB1 enable register     */
#define RCC_BDCR_DEFAULT_VAL                 (0x00000000U)                     /* Default value of backup control register  */
#define RCC_CSR_DEFAULT_VAL                  (0x0C000000U)                     /* Default value of control/status register  */

/* Bit definition for RCC_CR register */
#define RCC_CR_HSION_POS                     (0U)                              
#define RCC_CR_HSION_MASK                    (0x00000001)                      /* 0x00000001                       */
#define RCC_CR_HSION                         (RCC_CR_HSION_MASK)               /* Internal High Speed clock enable */
#define RCC_CR_HSIRDY_POS                    (1U)                              
#define RCC_CR_HSIRDY_MASK                   (0x00000002)                      /* 0x00000002                           */
#define RCC_CR_HSIRDY                        (RCC_CR_HSIRDY_MASK)              /* Internal High Speed clock ready flag */
#define RCC_CR_HSITRIM_POS                   (3U)                              
#define RCC_CR_HSITRIM_MASK                  (0x000000F8)                      /* 0x000000F8                         */
#define RCC_CR_HSITRIM                       (RCC_CR_HSITRIM_MASK)             /* Internal High Speed clock trimming */
#define RCC_CR_HSICAL_POS                    (8U)                              
#define RCC_CR_HSICAL_MASK                   (0x0000FF00)                      /* 0x0000FF00                            */
#define RCC_CR_HSICAL                        (RCC_CR_HSICAL_MASK)              /* Internal High Speed clock Calibration */
#define RCC_CR_HSEON_POS                     (16U)                             
#define RCC_CR_HSEON_MASK                    (0x00010000)                      /* 0x00010000                       */
#define RCC_CR_HSEON                         (RCC_CR_HSEON_MASK)               /* External High Speed clock enable */
#define RCC_CR_HSERDY_POS                    (17U)                             
#define RCC_CR_HSERDY_MASK                   (0x00020000)                      /* 0x00020000                           */
#define RCC_CR_HSERDY                        (RCC_CR_HSERDY_MASK)              /* External High Speed clock ready flag */
#define RCC_CR_HSEBYP_POS                    (18U)                             
#define RCC_CR_HSEBYP_MASK                   (0x00040000)                      /* 0x00040000                       */
#define RCC_CR_HSEBYP                        (RCC_CR_HSEBYP_MASK)              /* External High Speed clock Bypass */
#define RCC_CR_CSSON_POS                     (19U)                             
#define RCC_CR_CSSON_MASK                    (0x00080000)                      /* 0x00080000                   */
#define RCC_CR_CSSON                         (RCC_CR_CSSON_MASK)               /* Clock Security System enable */
#define RCC_CR_PLLON_POS                     (24U)                             
#define RCC_CR_PLLON_MASK                    (0x01000000)                      /* 0x01000000 */
#define RCC_CR_PLLON                         (RCC_CR_PLLON_MASK)               /* PLL enable */
#define RCC_CR_PLLRDY_POS                    (25U)                             
#define RCC_CR_PLLRDY_MASK                   (0x02000000)                      /* 0x02000000           */
#define RCC_CR_PLLRDY                        (RCC_CR_PLLRDY_MASK)              /* PLL clock ready flag */


/* Bit definition for RCC_CFGR register */
/* SW configuration */
#define RCC_CFGR_SW_POS                      (0U)                              
#define RCC_CFGR_SW_MASK                     (0x00000003)                      /* 0x00000003                         */
#define RCC_CFGR_SW                          (RCC_CFGR_SW_MASK)                /* SW[1:0] bits (System clock Switch) */
#define RCC_CFGR_SW_0                        (0x00000001)                      /* 0x00000001                         */
#define RCC_CFGR_SW_1                        (0x00000002)                      /* 0x00000002                         */

#define RCC_CFGR_SW_HSI                      (0x00000000)                      /* HSI selected as system clock */
#define RCC_CFGR_SW_HSE                      (0x00000001)                      /* HSE selected as system clock */
#define RCC_CFGR_SW_PLL                      (0x00000002)                      /* PLL selected as system clock */

/* SWS configuration */
#define RCC_CFGR_SWS_POS                     (2U)                              
#define RCC_CFGR_SWS_MASK                    (0x0000000C)                      /* 0x0000000C                                 */
#define RCC_CFGR_SWS                         (RCC_CFGR_SWS_MASK)               /* SWS[1:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_0                       (0x00000004)                      /* 0x00000004                                 */
#define RCC_CFGR_SWS_1                       (0x00000008)                      /* 0x00000008                                 */

#define RCC_CFGR_SWS_HSI                     (0x00000000)                      /* HSI oscillator used as system clock */
#define RCC_CFGR_SWS_HSE                     (0x00000004)                      /* HSE oscillator used as system clock */
#define RCC_CFGR_SWS_PLL                     (0x00000008)                      /* PLL used as system clock            */

/* HPRE configuration */
#define RCC_CFGR_HPRE_POS                    (4U)                              
#define RCC_CFGR_HPRE_MASK                   (0x000000F0)                      /* 0x000000F0                     */
#define RCC_CFGR_HPRE                        (RCC_CFGR_HPRE_MASK)              /* HPRE[3:0] bits (AHB prescaler) */
#define RCC_CFGR_HPRE_0                      (0x00000010)                      /* 0x00000010                     */
#define RCC_CFGR_HPRE_1                      (0x00000020)                      /* 0x00000020                     */
#define RCC_CFGR_HPRE_2                      (0x00000040)                      /* 0x00000040                     */
#define RCC_CFGR_HPRE_3                      (0x00000080)                      /* 0x00000080                     */
#define RCC_CFGR_HPRE_DIV_2                  (0x08U)

#define RCC_CFGR_HPRE_DIV1                   (0x00000000)                      /* SYSCLK not divided    */
#define RCC_CFGR_HPRE_DIV2                   (0x00000080)                      /* SYSCLK divided by 2   */
#define RCC_CFGR_HPRE_DIV4                   (0x00000090)                      /* SYSCLK divided by 4   */
#define RCC_CFGR_HPRE_DIV8                   (0x000000A0)                      /* SYSCLK divided by 8   */
#define RCC_CFGR_HPRE_DIV16                  (0x000000B0)                      /* SYSCLK divided by 16  */
#define RCC_CFGR_HPRE_DIV64                  (0x000000C0)                      /* SYSCLK divided by 64  */
#define RCC_CFGR_HPRE_DIV128                 (0x000000D0)                      /* SYSCLK divided by 128 */
#define RCC_CFGR_HPRE_DIV256                 (0x000000E0)                      /* SYSCLK divided by 256 */
#define RCC_CFGR_HPRE_DIV512                 (0x000000F0)                      /* SYSCLK divided by 512 */

