dwgan/STKNX_ChargeStation/source/cpus/STM32F10XX/include/stm32f10xx_rcc.h
/* PPRE1 configuration */
#define RCC_CFGR_PPRE1_POS                   (8U)                              
#define RCC_CFGR_PPRE1_MASK                  (0x00000700)                      /* 0x00000700                      */
#define RCC_CFGR_PPRE1                       (RCC_CFGR_PPRE1_MASK)             /* PRE1[2:0] bits (APB1 prescaler) */
#define RCC_CFGR_PPRE1_0                     (0x00000100)                      /* 0x00000100                      */
#define RCC_CFGR_PPRE1_1                     (0x00000200)                      /* 0x00000200                      */
#define RCC_CFGR_PPRE1_2                     (0x00000400)                      /* 0x00000400                      */
#define RCC_CFGR_PPRE1_DIV_2                 (0x04U)

#define RCC_CFGR_PPRE1_DIV1                  (0x00000000)                      /* HCLK not divided   */
#define RCC_CFGR_PPRE1_DIV2                  (0x00000400)                      /* HCLK divided by 2  */
#define RCC_CFGR_PPRE1_DIV4                  (0x00000500)                      /* HCLK divided by 4  */
#define RCC_CFGR_PPRE1_DIV8                  (0x00000600)                      /* HCLK divided by 8  */
#define RCC_CFGR_PPRE1_DIV16                 (0x00000700)                      /* HCLK divided by 16 */

/* PPRE2 configuration */
#define RCC_CFGR_PPRE2_POS                   (11U)                             
#define RCC_CFGR_PPRE2_MASK                  (0x00003800)                      /* 0x00003800                      */
#define RCC_CFGR_PPRE2                       (RCC_CFGR_PPRE2_MASK)             /* PRE2[2:0] bits (APB2 prescaler) */
#define RCC_CFGR_PPRE2_0                     (0x00000800)                      /* 0x00000800                      */
#define RCC_CFGR_PPRE2_1                     (0x00001000)                      /* 0x00001000                      */
#define RCC_CFGR_PPRE2_2                     (0x00002000)                      /* 0x00002000                      */
#define RCC_CFGR_PPRE2_DIV_2                 (0x04U)

#define RCC_CFGR_PPRE2_DIV1                  (0x00000000)                      /* HCLK not divided   */
#define RCC_CFGR_PPRE2_DIV2                  (0x00002000)                      /* HCLK divided by 2  */
#define RCC_CFGR_PPRE2_DIV4                  (0x00002800)                      /* HCLK divided by 4  */
#define RCC_CFGR_PPRE2_DIV8                  (0x00003000)                      /* HCLK divided by 8  */
#define RCC_CFGR_PPRE2_DIV16                 (0x00003800)                      /* HCLK divided by 16 */

/* ADCPPRE configuration */
#define RCC_CFGR_ADCPRE_POS                  (14U)                             
#define RCC_CFGR_ADCPRE_MASK                 (0x0000C000)                      /* 0x0000C000                       */
#define RCC_CFGR_ADCPRE                      (RCC_CFGR_ADCPRE_MASK)            /* ADCPRE[1:0] bits (ADC prescaler) */
#define RCC_CFGR_ADCPRE_0                    (0x00004000)                      /* 0x00004000                       */
#define RCC_CFGR_ADCPRE_1                    (0x00008000)                      /* 0x00008000                       */

#define RCC_CFGR_ADCPRE_DIV2                 (0x00000000)                      /* PCLK2 divided by 2 */
#define RCC_CFGR_ADCPRE_DIV4                 (0x00004000)                      /* PCLK2 divided by 4 */
#define RCC_CFGR_ADCPRE_DIV6                 (0x00008000)                      /* PCLK2 divided by 6 */
#define RCC_CFGR_ADCPRE_DIV8                 (0x0000C000)                      /* PCLK2 divided by 8 */

#define RCC_CFGR_PLLSRC_POS                  (16U)                             
#define RCC_CFGR_PLLSRC_MASK                 (0x00010000)                      /* 0x00010000             */
#define RCC_CFGR_PLLSRC                      (RCC_CFGR_PLLSRC_MASK)            /* PLL entry clock source */

#define RCC_CFGR_PLLXTPRE_POS                (17U)                             
#define RCC_CFGR_PLLXTPRE_MASK               (0x00020000 )                     /* 0x00020000                */
#define RCC_CFGR_PLLXTPRE                    (RCC_CFGR_PLLXTPRE_MASK)          /* HSE divider for PLL entry */

/* PLLMUL configuration */
#define RCC_CFGR_PLLMULL_POS                 (18U)                             
#define RCC_CFGR_PLLMULL_MASK                (0x003C0000)                      /* 0x003C0000                                   */
#define RCC_CFGR_PLLMULL                     (RCC_CFGR_PLLMULL_MASK)           /* PLLMUL[3:0] bits (PLL multiplication factor) */
#define RCC_CFGR_PLLMULL_0                   (0x00040000)                      /* 0x00040000                                   */
#define RCC_CFGR_PLLMULL_1                   (0x00080000)                      /* 0x00080000                                   */
#define RCC_CFGR_PLLMULL_2                   (0x00100000)                      /* 0x00100000                                   */
#define RCC_CFGR_PLLMULL_3                   (0x00200000)                      /* 0x00200000                                   */

#define RCC_CFGR_PLLXTPRE_HSE                (0x00000000)                      /* HSE clock not divided for PLL entry  */
#define RCC_CFGR_PLLXTPRE_HSE_DIV2           (0x00020000)                      /* HSE clock divided by 2 for PLL entry */

#define RCC_CFGR_PLLMULL2                    (0x00000000)                      /* PLL input clock*2 */
#define RCC_CFGR_PLLMULL3_POS                (18U)                             
#define RCC_CFGR_PLLMULL3_MASK               (0x00040000)                      /* 0x00040000        */
#define RCC_CFGR_PLLMULL3                    (RCC_CFGR_PLLMULL3_MASK)          /* PLL input clock*3 */
#define RCC_CFGR_PLLMULL4_POS                (19U)                             
#define RCC_CFGR_PLLMULL4_MASK               (0x00080000)                      /* 0x00080000        */
#define RCC_CFGR_PLLMULL4                    (RCC_CFGR_PLLMULL4_MASK)          /* PLL input clock*4 */
#define RCC_CFGR_PLLMULL5_POS                (18U)                             
#define RCC_CFGR_PLLMULL5_MASK               (0x000C0000)                      /* 0x000C0000        */
#define RCC_CFGR_PLLMULL5                    (RCC_CFGR_PLLMULL5_MASK)          /* PLL input clock*5 */
#define RCC_CFGR_PLLMULL6_POS                (20U)                             
#define RCC_CFGR_PLLMULL6_MASK               (0x00100000)                      /* 0x00100000        */
#define RCC_CFGR_PLLMULL6                    (RCC_CFGR_PLLMULL6_MASK)          /* PLL input clock*6 */
#define RCC_CFGR_PLLMULL7_POS                (18U)                             
#define RCC_CFGR_PLLMULL7_MASK               (0x00140000)                      /* 0x00140000        */
#define RCC_CFGR_PLLMULL7                    (RCC_CFGR_PLLMULL7_MASK)          /* PLL input clock*7 */
#define RCC_CFGR_PLLMULL8_POS                (19U)                             
#define RCC_CFGR_PLLMULL8_MASK               (0x00180000)                      /* 0x00180000        */
#define RCC_CFGR_PLLMULL8                    (RCC_CFGR_PLLMULL8_MASK)          /* PLL input clock*8 */
#define RCC_CFGR_PLLMULL9_POS                (18U)                             
#define RCC_CFGR_PLLMULL9_MASK               (0x001C0000)                      /* 0x001C0000        */
#define RCC_CFGR_PLLMULL9                    (RCC_CFGR_PLLMULL9_MASK)          /* PLL input clock*9 */
#define RCC_CFGR_PLLMULL10_POS               (21U)                             
#define RCC_CFGR_PLLMULL10_MASK              (0x00200000)                      /* 0x00200000        */
#define RCC_CFGR_PLLMULL10                   (RCC_CFGR_PLLMULL10_MASK)         /* PLL input clock10 */
#define RCC_CFGR_PLLMULL11_POS               (18U)                             
#define RCC_CFGR_PLLMULL11_MASK              (0x00240000)                      /* 0x00240000         */
#define RCC_CFGR_PLLMULL11                   (RCC_CFGR_PLLMULL11_MASK)         /* PLL input clock*11 */
#define RCC_CFGR_PLLMULL12_POS               (19U)                             
#define RCC_CFGR_PLLMULL12_MASK              (0x00280000)                      /* 0x00280000         */
#define RCC_CFGR_PLLMULL12                   (RCC_CFGR_PLLMULL12_MASK)         /* PLL input clock*12 */
#define RCC_CFGR_PLLMULL13_POS               (18U)                             
#define RCC_CFGR_PLLMULL13_MASK              (0x002C0000)                      /* 0x002C0000         */
#define RCC_CFGR_PLLMULL13                   (RCC_CFGR_PLLMULL13_MASK)         /* PLL input clock*13 */
#define RCC_CFGR_PLLMULL14_POS               (20U)                             
#define RCC_CFGR_PLLMULL14_MASK              (0x00300000)                      /* 0x00300000         */
#define RCC_CFGR_PLLMULL14                   (RCC_CFGR_PLLMULL14_MASK)         /* PLL input clock*14 */
#define RCC_CFGR_PLLMULL15_POS               (18U)                             
#define RCC_CFGR_PLLMULL15_MASK              (0x00340000)                      /* 0x00340000         */
#define RCC_CFGR_PLLMULL15                   (RCC_CFGR_PLLMULL15_MASK)         /* PLL input clock*15 */
#define RCC_CFGR_PLLMULL16_POS               (19U)                             
#define RCC_CFGR_PLLMULL16_MASK              (0x00380000)                      /* 0x00380000         */
#define RCC_CFGR_PLLMULL16                   (RCC_CFGR_PLLMULL16_MASK)         /* PLL input clock*16 */
#define RCC_CFGR_USBPRE_POS                  (22U)                             
#define RCC_CFGR_USBPRE_MASK                 (0x00400000)                      /* 0x00400000           */
#define RCC_CFGR_USBPRE                      (RCC_CFGR_USBPRE_MASK)            /* USB Device prescaler */

/* MCO configuration */
#define RCC_CFGR_MCO_POS                     (24U)                             
#define RCC_CFGR_MCO_MASK                    (0x07000000)                      /* 0x07000000                                   */
#define RCC_CFGR_MCO                         (RCC_CFGR_MCO_MASK)               /* MCO[2:0] bits (Microcontroller Clock Output) */
#define RCC_CFGR_MCO_0                       (0x01000000)                      /* 0x01000000                                   */
#define RCC_CFGR_MCO_1                       (0x02000000)                      /* 0x02000000                                   */
#define RCC_CFGR_MCO_2                       (0x04000000)                      /* 0x04000000                                   */

#define RCC_CFGR_MCO_NOCLOCK                 (0x00000000)                      /* No clock                                      */
#define RCC_CFGR_MCO_SYSCLK                  (0x04000000)                      /* System clock selected as MCO source           */
#define RCC_CFGR_MCO_HSI                     (0x05000000)                      /* HSI clock selected as MCO source              */
#define RCC_CFGR_MCO_HSE                     (0x06000000)                      /* HSE clock selected as MCO source              */
#define RCC_CFGR_MCO_PLLCLK_DIV2             (0x07000000)                      /* PLL clock divided by 2 selected as MCO source */

 /* Reference defines */
 #define RCC_CFGR_MCOSEL                     (RCC_CFGR_MCO)
 #define RCC_CFGR_MCOSEL_0                   (RCC_CFGR_MCO_0)
 #define RCC_CFGR_MCOSEL_1                   (RCC_CFGR_MCO_1)
 #define RCC_CFGR_MCOSEL_2                   (RCC_CFGR_MCO_2)
 #define RCC_CFGR_MCOSEL_NOCLOCK             (RCC_CFGR_MCO_NOCLOCK)
 #define RCC_CFGR_MCOSEL_SYSCLK              (RCC_CFGR_MCO_SYSCLK)
 #define RCC_CFGR_MCOSEL_HSI                 (RCC_CFGR_MCO_HSI)
 #define RCC_CFGR_MCOSEL_HSE                 (RCC_CFGR_MCO_HSE)
 #define RCC_CFGR_MCOSEL_PLL_DIV2            (RCC_CFGR_MCO_PLLCLK_DIV2)

