dwgan/STKNX_ChargeStation/source/cpus/STM32F10XX/include/stm32f10xx_rcc.h
/* Bit definition for RCC_CIR register */
#define RCC_CIR_LSIRDYF_POS                  (0U)                              
#define RCC_CIR_LSIRDYF_MASK                 (0x00000001)                      /* 0x00000001               */
#define RCC_CIR_LSIRDYF                      (RCC_CIR_LSIRDYF_MASK)            /* LSI Ready Interrupt flag */
#define RCC_CIR_LSERDYF_POS                  (1U)                              
#define RCC_CIR_LSERDYF_MASK                 (0x00000002)                      /* 0x00000002               */
#define RCC_CIR_LSERDYF                      (RCC_CIR_LSERDYF_MASK)            /* LSE Ready Interrupt flag */
#define RCC_CIR_HSIRDYF_POS                  (2U)                              
#define RCC_CIR_HSIRDYF_MASK                 (0x00000004)                      /* 0x00000004               */
#define RCC_CIR_HSIRDYF                      (RCC_CIR_HSIRDYF_MASK)            /* HSI Ready Interrupt flag */
#define RCC_CIR_HSERDYF_POS                  (3U)                              
#define RCC_CIR_HSERDYF_MASK                 (0x00000008)                      /* 0x00000008               */
#define RCC_CIR_HSERDYF                      (RCC_CIR_HSERDYF_MASK)            /* HSE Ready Interrupt flag */
#define RCC_CIR_PLLRDYF_POS                  (4U)                              
#define RCC_CIR_PLLRDYF_MASK                 (0x00000010)                      /* 0x00000010               */
#define RCC_CIR_PLLRDYF                      (RCC_CIR_PLLRDYF_MASK)            /* PLL Ready Interrupt flag */
#define RCC_CIR_CSSF_POS                     (7U)                              
#define RCC_CIR_CSSF_MASK                    (0x00000080)                      /* 0x00000080                           */
#define RCC_CIR_CSSF                         (RCC_CIR_CSSF_MASK)               /* Clock Security System Interrupt flag */
#define RCC_CIR_LSIRDYIE_POS                 (8U)                              
#define RCC_CIR_LSIRDYIE_MASK                (0x00000100)                      /* 0x00000100                 */
#define RCC_CIR_LSIRDYIE                     (RCC_CIR_LSIRDYIE_MASK)           /* LSI Ready Interrupt Enable */
#define RCC_CIR_LSERDYIE_POS                 (9U)                              
#define RCC_CIR_LSERDYIE_MASK                (0x00000200)                      /* 0x00000200                 */
#define RCC_CIR_LSERDYIE                     (RCC_CIR_LSERDYIE_MASK)           /* LSE Ready Interrupt Enable */
#define RCC_CIR_HSIRDYIE_POS                 (10U)                             
#define RCC_CIR_HSIRDYIE_MASK                (0x00000400)                      /* 0x00000400                 */
#define RCC_CIR_HSIRDYIE                     (RCC_CIR_HSIRDYIE_MASK)           /* HSI Ready Interrupt Enable */
#define RCC_CIR_HSERDYIE_POS                 (11U)                             
#define RCC_CIR_HSERDYIE_MASK                (0x00000800)                      /* 0x00000800                 */
#define RCC_CIR_HSERDYIE                     (RCC_CIR_HSERDYIE_MASK)           /* HSE Ready Interrupt Enable */
#define RCC_CIR_PLLRDYIE_POS                 (12U)                             
#define RCC_CIR_PLLRDYIE_MASK                (0x00001000)                      /* 0x00001000                 */
#define RCC_CIR_PLLRDYIE                     (RCC_CIR_PLLRDYIE_MASK)           /* PLL Ready Interrupt Enable */
#define RCC_CIR_LSIRDYC_POS                  (16U)                             
#define RCC_CIR_LSIRDYC_MASK                 (0x00010000)                      /* 0x00010000                */
#define RCC_CIR_LSIRDYC                      (RCC_CIR_LSIRDYC_MASK)            /* LSI Ready Interrupt Clear */
#define RCC_CIR_LSERDYC_POS                  (17U)                             
#define RCC_CIR_LSERDYC_MASK                 (0x00020000)                      /* 0x00020000                */
#define RCC_CIR_LSERDYC                      (RCC_CIR_LSERDYC_MASK)            /* LSE Ready Interrupt Clear */
#define RCC_CIR_HSIRDYC_POS                  (18U)                             
#define RCC_CIR_HSIRDYC_MASK                 (0x00040000)                      /* 0x00040000                */
#define RCC_CIR_HSIRDYC                      (RCC_CIR_HSIRDYC_MASK)            /* HSI Ready Interrupt Clear */
#define RCC_CIR_HSERDYC_POS                  (19U)                             
#define RCC_CIR_HSERDYC_MASK                 (0x00080000)                      /* 0x00080000                */
#define RCC_CIR_HSERDYC                      (RCC_CIR_HSERDYC_MASK)            /* HSE Ready Interrupt Clear */
#define RCC_CIR_PLLRDYC_POS                  (20U)                             
#define RCC_CIR_PLLRDYC_MASK                 (0x00100000)                      /* 0x00100000                */
#define RCC_CIR_PLLRDYC                      (RCC_CIR_PLLRDYC_MASK)            /* PLL Ready Interrupt Clear */
#define RCC_CIR_CSSC_POS                     (23U)                             
#define RCC_CIR_CSSC_MASK                    (0x00800000)                      /* 0x00800000                            */
#define RCC_CIR_CSSC                         (RCC_CIR_CSSC_MASK)               /* Clock Security System Interrupt Clear */


/* Bit definition for RCC_APB2RSTR register */
#define RCC_APB2RSTR_AFIORST_POS             (0U)                              
#define RCC_APB2RSTR_AFIORST_MASK            (0x00000001)                      /* 0x00000001                  */
#define RCC_APB2RSTR_AFIORST                 (RCC_APB2RSTR_AFIORST_MASK)       /* Alternate Function I/O reset */
#define RCC_APB2RSTR_IOPARST_POS             (2U)                              
#define RCC_APB2RSTR_IOPARST_MASK            (0x00000004)                      /* 0x00000004      */
#define RCC_APB2RSTR_IOPARST                 (RCC_APB2RSTR_IOPARST_MASK)       /* I/O port A reset */
#define RCC_APB2RSTR_IOPBRST_POS             (3U)                              
#define RCC_APB2RSTR_IOPBRST_MASK            (0x00000008)                      /* 0x00000008      */
#define RCC_APB2RSTR_IOPBRST                 (RCC_APB2RSTR_IOPBRST_MASK)       /* I/O port B reset */
#define RCC_APB2RSTR_IOPCRST_POS             (4U)                              
#define RCC_APB2RSTR_IOPCRST_MASK            (0x00000010)                      /* 0x00000010      */
#define RCC_APB2RSTR_IOPCRST                 (RCC_APB2RSTR_IOPCRST_MASK)       /* I/O port C reset */
#define RCC_APB2RSTR_IOPDRST_POS             (5U)                              
#define RCC_APB2RSTR_IOPDRST_MASK            (0x00000020)                      /* 0x00000020      */
#define RCC_APB2RSTR_IOPDRST                 (RCC_APB2RSTR_IOPDRST_MASK)       /* I/O port D reset */
#define RCC_APB2RSTR_ADC1RST_POS             (9U)                              
#define RCC_APB2RSTR_ADC1RST_MASK            (0x00000200)                      /* 0x00000200           */
#define RCC_APB2RSTR_ADC1RST                 (RCC_APB2RSTR_ADC1RST_MASK)       /* ADC 1 interface reset */

#define RCC_APB2RSTR_ADC2RST_POS             (10U)                             
#define RCC_APB2RSTR_ADC2RST_MASK            (0x00000400)                      /* 0x00000400           */
#define RCC_APB2RSTR_ADC2RST                 (RCC_APB2RSTR_ADC2RST_MASK)       /* ADC 2 interface reset */

#define RCC_APB2RSTR_TIM1RST_POS             (11U)                             
#define RCC_APB2RSTR_TIM1RST_MASK            (0x00000800)                      /* 0x00000800      */
#define RCC_APB2RSTR_TIM1RST                 (RCC_APB2RSTR_TIM1RST_MASK)       /* TIM1 Timer reset */
#define RCC_APB2RSTR_SPI1RST_POS             (12U)                             
#define RCC_APB2RSTR_SPI1RST_MASK            (0x00001000)                      /* 0x00001000 */
#define RCC_APB2RSTR_SPI1RST                 (RCC_APB2RSTR_SPI1RST_MASK)       /* SPI 1 reset */
#define RCC_APB2RSTR_USART1RST_POS           (14U)                             
#define RCC_APB2RSTR_USART1RST_MASK          (0x00004000)                      /* 0x00004000 */
#define RCC_APB2RSTR_USART1RST               (RCC_APB2RSTR_USART1RST_MASK)     /* USART1 reset  */

