dwgan/STKNX_ChargeStation/source/cpus/STM32F10XX/include/stm32f10xx_rcc.h
#define RCC_APB2RSTR_IOPERST_POS             (6U)                              
#define RCC_APB2RSTR_IOPERST_MASK            (0x00000040)                      /* 0x00000040      */
#define RCC_APB2RSTR_IOPERST                 (RCC_APB2RSTR_IOPERST_MASK)       /* I/O port E reset */


/* Bit definition for RCC_APB1RSTR register */
#define RCC_APB1RSTR_TIM2RST_POS             (0U)                              
#define RCC_APB1RSTR_TIM2RST_MASK            (0x00000001)                      /* 0x00000001   */
#define RCC_APB1RSTR_TIM2RST                 (RCC_APB1RSTR_TIM2RST_MASK)       /* Timer 2 reset */
#define RCC_APB1RSTR_TIM3RST_POS             (1U)                              
#define RCC_APB1RSTR_TIM3RST_MASK            (0x00000002)                      /* 0x00000002   */
#define RCC_APB1RSTR_TIM3RST                 (RCC_APB1RSTR_TIM3RST_MASK)       /* Timer 3 reset */
#define RCC_APB1RSTR_WWDGRST_POS             (11U)                             
#define RCC_APB1RSTR_WWDGRST_MASK            (0x00000800)                      /* 0x00000800           */
#define RCC_APB1RSTR_WWDGRST                 (RCC_APB1RSTR_WWDGRST_MASK)       /* Window Watchdog reset */
#define RCC_APB1RSTR_USART2RST_POS           (17U)                             
#define RCC_APB1RSTR_USART2RST_MASK          (0x00020000)                      /* 0x00020000 */
#define RCC_APB1RSTR_USART2RST               (RCC_APB1RSTR_USART2RST_MASK)     /* USART 2 reset */
#define RCC_APB1RSTR_I2C1RST_POS             (21U)                             
#define RCC_APB1RSTR_I2C1RST_MASK            (0x00200000)                      /* 0x00200000 */
#define RCC_APB1RSTR_I2C1RST                 (RCC_APB1RSTR_I2C1RST_MASK)       /* I2C 1 reset */

#define RCC_APB1RSTR_CAN1RST_POS             (25U)                             
#define RCC_APB1RSTR_CAN1RST_MASK            (0x02000000)                      /* 0x02000000 */
#define RCC_APB1RSTR_CAN1RST                 (RCC_APB1RSTR_CAN1RST_MASK)       /* CAN1 reset  */

#define RCC_APB1RSTR_BKPRST_POS              (27U)                             
#define RCC_APB1RSTR_BKPRST_MASK             (0x08000000)                      /* 0x08000000             */
#define RCC_APB1RSTR_BKPRST                  (RCC_APB1RSTR_BKPRST_MASK)        /* Backup interface reset */
#define RCC_APB1RSTR_PWRRST_POS              (28U)                             
#define RCC_APB1RSTR_PWRRST_MASK             (0x10000000)                      /* 0x10000000            */
#define RCC_APB1RSTR_PWRRST                  (RCC_APB1RSTR_PWRRST_MASK)        /* Power interface reset */

#define RCC_APB1RSTR_TIM4RST_POS             (2U)                              
#define RCC_APB1RSTR_TIM4RST_MASK            (0x00000004)                      /* 0x00000004   */
#define RCC_APB1RSTR_TIM4RST                 (RCC_APB1RSTR_TIM4RST_MASK)       /* Timer 4 reset */
#define RCC_APB1RSTR_SPI2RST_POS             (14U)                             
#define RCC_APB1RSTR_SPI2RST_MASK            (0x00004000)                      /* 0x00004000 */
#define RCC_APB1RSTR_SPI2RST                 (RCC_APB1RSTR_SPI2RST_MASK)       /* SPI 2 reset */
#define RCC_APB1RSTR_USART3RST_POS           (18U)                             
#define RCC_APB1RSTR_USART3RST_MASK          (0x00040000)                      /* 0x00040000 */
#define RCC_APB1RSTR_USART3RST               (RCC_APB1RSTR_USART3RST_MASK)     /* USART 3 reset */
#define RCC_APB1RSTR_I2C2RST_POS             (22U)                             
#define RCC_APB1RSTR_I2C2RST_MASK            (0x00400000)                      /* 0x00400000 */
#define RCC_APB1RSTR_I2C2RST                 (RCC_APB1RSTR_I2C2RST_MASK)       /* I2C 2 reset */

#define RCC_APB1RSTR_USBRST_POS              (23U)                             
#define RCC_APB1RSTR_USBRST_MASK             (0x00800000)                      /* 0x00800000       */
#define RCC_APB1RSTR_USBRST                  (RCC_APB1RSTR_USBRST_MASK)        /* USB Device reset */


/* Bit definition for RCC_AHBENR register */
#define RCC_AHBENR_DMA1EN_POS                (0U)                              
#define RCC_AHBENR_DMA1EN_MASK               (0x00000001)                      /* 0x00000001        */
#define RCC_AHBENR_DMA1EN                    (RCC_AHBENR_DMA1EN_MASK)          /* DMA1 clock enable */
#define RCC_AHBENR_SRAMEN_POS                (2U)                              
#define RCC_AHBENR_SRAMEN_MASK               (0x00000004)                      /* 0x00000004                  */
#define RCC_AHBENR_SRAMEN                    (RCC_AHBENR_SRAMEN_MASK)          /* SRAM interface clock enable */
#define RCC_AHBENR_FLITFEN_POS               (4U)                              
#define RCC_AHBENR_FLITFEN_MASK              (0x00000010)                      /* 0x00000010         */
#define RCC_AHBENR_FLITFEN                   (RCC_AHBENR_FLITFEN_MASK)         /* FLITF clock enable */
#define RCC_AHBENR_CRCEN_POS                 (6U)                              
#define RCC_AHBENR_CRCEN_MASK                (0x00000040)                      /* 0x00000040       */
#define RCC_AHBENR_CRCEN                     (RCC_AHBENR_CRCEN_MASK)           /* CRC clock enable */


/* Bit definition for RCC_APB2ENR register */
#define RCC_APB2ENR_AFIOEN_POS               (0U)                              
#define RCC_APB2ENR_AFIOEN_MASK              (0x00000001)                      /* 0x00000001                          */
#define RCC_APB2ENR_AFIOEN                   (RCC_APB2ENR_AFIOEN_MASK)         /* Alternate Function I/O clock enable */
#define RCC_APB2ENR_IOPAEN_POS               (2U)                              
#define RCC_APB2ENR_IOPAEN_MASK              (0x00000004)                      /* 0x00000004              */
#define RCC_APB2ENR_IOPAEN                   (RCC_APB2ENR_IOPAEN_MASK)         /* I/O port A clock enable */
#define RCC_APB2ENR_IOPBEN_POS               (3U)                              
#define RCC_APB2ENR_IOPBEN_MASK              (0x00000008)                      /* 0x00000008              */
#define RCC_APB2ENR_IOPBEN                   (RCC_APB2ENR_IOPBEN_MASK)         /* I/O port B clock enable */
#define RCC_APB2ENR_IOPCEN_POS               (4U)                              
#define RCC_APB2ENR_IOPCEN_MASK              (0x00000010)                      /* 0x00000010              */
#define RCC_APB2ENR_IOPCEN                   (RCC_APB2ENR_IOPCEN_MASK)         /* I/O port C clock enable */
#define RCC_APB2ENR_IOPDEN_POS               (5U)                              
#define RCC_APB2ENR_IOPDEN_MASK              (0x00000020)                      /* 0x00000020              */
#define RCC_APB2ENR_IOPDEN                   (RCC_APB2ENR_IOPDEN_MASK)         /* I/O port D clock enable */
#define RCC_APB2ENR_ADC1EN_POS               (9U)                              
#define RCC_APB2ENR_ADC1EN_MASK              (0x00000200)                      /* 0x00000200                   */
#define RCC_APB2ENR_ADC1EN                   (RCC_APB2ENR_ADC1EN_MASK)         /* ADC 1 interface clock enable */

#define RCC_APB2ENR_ADC2EN_POS               (10U)                             
#define RCC_APB2ENR_ADC2EN_MASK              (0x00000400)                      /* 0x00000400                   */
#define RCC_APB2ENR_ADC2EN                   (RCC_APB2ENR_ADC2EN_MASK)         /* ADC 2 interface clock enable */

#define RCC_APB2ENR_TIM1EN_POS               (11U)                             
#define RCC_APB2ENR_TIM1EN_MASK              (0x00000800)                      /* 0x00000800              */
#define RCC_APB2ENR_TIM1EN                   (RCC_APB2ENR_TIM1EN_MASK)         /* TIM1 Timer clock enable */
#define RCC_APB2ENR_SPI1EN_POS               (12U)                             
#define RCC_APB2ENR_SPI1EN_MASK              (0x00001000)                      /* 0x00001000          */
#define RCC_APB2ENR_SPI1EN                   (RCC_APB2ENR_SPI1EN_MASK)         /* SPI 1 clock enable  */
#define RCC_APB2ENR_USART1EN_POS             (14U)                             
#define RCC_APB2ENR_USART1EN_MASK            (0x00004000)                      /* 0x00004000         */
#define RCC_APB2ENR_USART1EN                 (RCC_APB2ENR_USART1EN_MASK)       /* USART1 clock enable */


