dwgan/STKNX_ChargeStation/source/cpus/STM32F10XX/include/stm32f10xx_rcc.h
#define RCC_APB2ENR_IOPEEN_POS               (6U)                              
#define RCC_APB2ENR_IOPEEN_MASK              (0x00000040)                      /* 0x00000040              */
#define RCC_APB2ENR_IOPEEN                   (RCC_APB2ENR_IOPEEN_MASK)         /* I/O port E clock enable */


/* Bit definition for RCC_APB1ENR register */
#define RCC_APB1ENR_TIM2EN_POS               (0U)                              
#define RCC_APB1ENR_TIM2EN_MASK              (0x00000001)                      /* 0x00000001            */
#define RCC_APB1ENR_TIM2EN                   (RCC_APB1ENR_TIM2EN_MASK)         /* Timer 2 clock enabled */
#define RCC_APB1ENR_TIM3EN_POS               (1U)                              
#define RCC_APB1ENR_TIM3EN_MASK              (0x00000002)                      /* 0x00000002            */
#define RCC_APB1ENR_TIM3EN                   (RCC_APB1ENR_TIM3EN_MASK)         /* Timer 3 clock enable  */
#define RCC_APB1ENR_WWDGEN_POS               (11U)                             
#define RCC_APB1ENR_WWDGEN_MASK              (0x00000800)                      /* 0x00000800                   */
#define RCC_APB1ENR_WWDGEN                   (RCC_APB1ENR_WWDGEN_MASK)         /* Window Watchdog clock enable */
#define RCC_APB1ENR_USART2EN_POS             (17U)                             
#define RCC_APB1ENR_USART2EN_MASK            (0x00020000)                      /* 0x00020000          */
#define RCC_APB1ENR_USART2EN                 (RCC_APB1ENR_USART2EN_MASK)       /* USART 2 clock enable */
#define RCC_APB1ENR_I2C1EN_POS               (21U)                             
#define RCC_APB1ENR_I2C1EN_MASK              (0x00200000)                      /* 0x00200000         */
#define RCC_APB1ENR_I2C1EN                   (RCC_APB1ENR_I2C1EN_MASK)         /* I2C 1 clock enable */

#define RCC_APB1ENR_CAN1EN_POS               (25U)                             
#define RCC_APB1ENR_CAN1EN_MASK              (0x02000000)                      /* 0x02000000        */
#define RCC_APB1ENR_CAN1EN                   (RCC_APB1ENR_CAN1EN_MASK)         /* CAN1 clock enable */

#define RCC_APB1ENR_BKPEN_POS                (27U)                             
#define RCC_APB1ENR_BKPEN_MASK               (0x08000000)                      /* 0x08000000                    */
#define RCC_APB1ENR_BKPEN                    (RCC_APB1ENR_BKPEN_MASK)          /* Backup interface clock enable */
#define RCC_APB1ENR_PWREN_POS                (28U)                             
#define RCC_APB1ENR_PWREN_MASK               (0x10000000)                      /* 0x10000000                   */
#define RCC_APB1ENR_PWREN                    (RCC_APB1ENR_PWREN_MASK)          /* Power interface clock enable */

#define RCC_APB1ENR_TIM4EN_POS               (2U)                              
#define RCC_APB1ENR_TIM4EN_MASK              (0x00000004)                      /* 0x00000004           */
#define RCC_APB1ENR_TIM4EN                   (RCC_APB1ENR_TIM4EN_MASK)         /* Timer 4 clock enable */
#define RCC_APB1ENR_SPI2EN_POS               (14U)                             
#define RCC_APB1ENR_SPI2EN_MASK              (0x00004000)                      /* 0x00004000           */
#define RCC_APB1ENR_SPI2EN                   (RCC_APB1ENR_SPI2EN_MASK)         /* SPI 2 clock enable   */
#define RCC_APB1ENR_USART3EN_POS             (18U)                             
#define RCC_APB1ENR_USART3EN_MASK            (0x00040000)                      /* 0x00040000          */
#define RCC_APB1ENR_USART3EN                 (RCC_APB1ENR_USART3EN_MASK)       /* USART 3 clock enable */
#define RCC_APB1ENR_I2C2EN_POS               (22U)                             
#define RCC_APB1ENR_I2C2EN_MASK              (0x00400000)                      /* 0x00400000           */
#define RCC_APB1ENR_I2C2EN                   (RCC_APB1ENR_I2C2EN_MASK)         /* I2C 2 clock enable   */

#define RCC_APB1ENR_USBEN_POS                (23U)                             
#define RCC_APB1ENR_USBEN_MASK               (0x00800000)                      /* 0x00800000              */
#define RCC_APB1ENR_USBEN                    (RCC_APB1ENR_USBEN_MASK)          /* USB Device clock enable */


/* Bit definition for RCC_BDCR register */
#define RCC_BDCR_LSEON_POS                   (0U)                              
#define RCC_BDCR_LSEON_MASK                  (0x00000001)                      /* 0x00000001                           */
#define RCC_BDCR_LSEON                       (RCC_BDCR_LSEON_MASK)             /* External Low Speed oscillator enable */
#define RCC_BDCR_LSERDY_POS                  (1U)                              
#define RCC_BDCR_LSERDY_MASK                 (0x00000002)                      /* 0x00000002                           */
#define RCC_BDCR_LSERDY                      (RCC_BDCR_LSERDY_MASK)            /* External Low Speed oscillator Ready  */
#define RCC_BDCR_LSEBYP_POS                  (2U)                              
#define RCC_BDCR_LSEBYP_MASK                 (0x00000004)                      /* 0x00000004                           */
#define RCC_BDCR_LSEBYP                      (RCC_BDCR_LSEBYP_MASK)            /* External Low Speed oscillator Bypass */

#define RCC_BDCR_RTCSEL_POS                  (8U)                              
#define RCC_BDCR_RTCSEL_MASK                 (0x00000300)                      /* 0x00000300                                    */
#define RCC_BDCR_RTCSEL                      (RCC_BDCR_RTCSEL_MASK)            /* RTCSEL[1:0] bits (RTC clock source selection) */
#define RCC_BDCR_RTCSEL_0                    (0x00000100)                      /* 0x00000100                                    */
#define RCC_BDCR_RTCSEL_1                    (0x00000200)                      /* 0x00000200                                    */

/* RTC congiguration */
#define RCC_BDCR_RTCSEL_NOCLOCK              (0x00000000)                      /* No clock                               */
#define RCC_BDCR_RTCSEL_LSE                  (0x00000100)                      /* LSE oscillator clock used as RTC clock */
#define RCC_BDCR_RTCSEL_LSI                  (0x00000200)                      /* LSI oscillator clock used as RTC clock */
#define RCC_BDCR_RTCSEL_HSE                  (0x00000300)                      /* HSE oscillator clock divided by 128 used as RTC clock */

#define RCC_BDCR_RTCEN_POS                   (15U)                             
#define RCC_BDCR_RTCEN_MASK                  (0x00008000)                      /* 0x00008000       */
#define RCC_BDCR_RTCEN                       (RCC_BDCR_RTCEN_MASK)             /* RTC clock enable */
#define RCC_BDCR_BDRST_POS                   (16U)                             
#define RCC_BDCR_BDRST_MASK                  (0x00010000)                      /* 0x00010000                   */
#define RCC_BDCR_BDRST                       (RCC_BDCR_BDRST_MASK)             /* Backup domain software reset */

/* Bit definition for RCC_CSR register */  
#define RCC_CSR_LSION_POS                    (0U)                              
#define RCC_CSR_LSION_MASK                   (0x00000001)                      /* 0x00000001                           */
#define RCC_CSR_LSION                        (RCC_CSR_LSION_MASK)              /* Internal Low Speed oscillator enable */
#define RCC_CSR_LSIRDY_POS                   (1U)                              
#define RCC_CSR_LSIRDY_MASK                  (0x00000002)                      /* 0x00000002                           */
#define RCC_CSR_LSIRDY                       (RCC_CSR_LSIRDY_MASK)             /* Internal Low Speed oscillator Ready  */
#define RCC_CSR_RMVF_POS                     (24U)                             
#define RCC_CSR_RMVF_MASK                    (0x01000000)                      /* 0x01000000        */
#define RCC_CSR_RMVF                         (RCC_CSR_RMVF_MASK)               /* Remove reset flag */
#define RCC_CSR_PINRSTF_POS                  (26U)                             
#define RCC_CSR_PINRSTF_MASK                 (0x04000000)                      /* 0x04000000     */
#define RCC_CSR_PINRSTF                      (RCC_CSR_PINRSTF_MASK)            /* PIN reset flag */
#define RCC_CSR_PORRSTF_POS                  (27U)                             
#define RCC_CSR_PORRSTF_MASK                 (0x08000000)                      /* 0x08000000         */
#define RCC_CSR_PORRSTF                      (RCC_CSR_PORRSTF_MASK)            /* POR/PDR reset flag */
#define RCC_CSR_SFTRSTF_POS                  (28U)                             
#define RCC_CSR_SFTRSTF_MASK                 (0x10000000)                      /* 0x10000000          */
#define RCC_CSR_SFTRSTF                      (RCC_CSR_SFTRSTF_MASK)            /* Software Reset flag */
#define RCC_CSR_IWDGRSTF_POS                 (29U)                             
#define RCC_CSR_IWDGRSTF_MASK                (0x20000000)                      /* 0x20000000                      */
#define RCC_CSR_IWDGRSTF                     (RCC_CSR_IWDGRSTF_MASK)           /* Independent Watchdog reset flag */
#define RCC_CSR_WWDGRSTF_POS                 (30U)                             
#define RCC_CSR_WWDGRSTF_MASK                (0x40000000)                      /* 0x40000000                 */
#define RCC_CSR_WWDGRSTF                     (RCC_CSR_WWDGRSTF_MASK)           /* Window watchdog reset flag */
#define RCC_CSR_LPWRRSTF_POS                 (31U)                             
#define RCC_CSR_LPWRRSTF_MASK                (0x80000000)                      /* 0x80000000           */
#define RCC_CSR_LPWRRSTF                     (RCC_CSR_LPWRRSTF_MASK)           /* Low-Power reset flag */

/* Data structure definition */
/* RCC register */
/****************************************************
*   Structure£º  T_RCC_MEM_MAP
*   Description£ºMemory map of RCC registers.
*   Parameter:   WORD32 CR          RCC clock control register   
*                WORD32 CFGR        RCC clock configure register 
*                WORD32 CIR         RCC clock interrupt register 
*                WORD32 APB2RSTR    RCC APB2 reset register      
*                WORD32 APB1RSTR    RCC APB1 reset register      
*                WORD32 AHBENR      RCC AHB enable register      
*                WORD32 APB2ENR     RCC APB2 enable register     
*                WORD32 APB1ENR     RCC APB1 enable register     
*                WORD32 BDCR        RCC backup control register  
*                WORD32 CSR         RCC control/status register 
*   Authour£º    Ian
*   Modify record:
*   Date:  2016-7-25 creat.
****************************************************/
typedef struct _T_RCC_MEM_MAP
{
    WORD32 CR;          /* RCC clock control register   */
    WORD32 CFGR;        /* RCC clock configure register */
    WORD32 CIR;         /* RCC clock interrupt register */
    WORD32 APB2RSTR;    /* RCC APB2 reset register      */
    WORD32 APB1RSTR;    /* RCC APB1 reset register      */
    WORD32 AHBENR;      /* RCC AHB enable register      */
    WORD32 APB2ENR;     /* RCC APB2 enable register     */
    WORD32 APB1ENR;     /* RCC APB1 enable register     */
    WORD32 BDCR;        /* RCC backup control register  */
    WORD32 CSR;         /* RCC control/status register  */
}volatile *T_RCC_MEM_MAP;



/* Declaration of functions */
/**************************************************************************
* Function: WORD32 Rcc_SysClk_Config(BYTE ucSetClk)
* Descrip.: Configure system clock
* Input   : BYTE ucSetClk       Desired clock in MHz
* Output  : None
* Return  : SW_OK    Successful
*           SW_ERR   Failed
* Note    £ºNone
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/26       V1.0         Ian          Create 
**************************************************************************/
WORD32 Rcc_SysClk_Config(BYTE ucSetClk);

/**************************************************************************
* Function: WORD32 Rcc_Get_SYSCLK(void)
* Descrip.: Get SYSCLK in Hz
* Input   : None
* Output  : None
* Return  : WORD32 SYSCLK in Hz
* Note    £ºNone
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/08/01       V1.0         Ian          Create 
**************************************************************************/
WORD32 Rcc_Get_SYSCLK(void);

/**************************************************************************
* Function: WORD32 Rcc_Get_HCLK(void)
* Descrip.: Get HCLK in Hz
* Input   : None
* Output  : None
* Return  : WORD32 HCLK in Hz
* Note    £ºNone
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/08/01       V1.0         Ian          Create 
**************************************************************************/
WORD32 Rcc_Get_HCLK(void);

/**************************************************************************
* Function: WORD32 Rcc_Get_PCLK1(void)
* Descrip.: Get PCLK1 in Hz
* Input   : None
* Output  : None
* Return  : WORD32 PCLK1 in Hz
* Note    £ºNone
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/08/01       V1.0         Ian          Create 
**************************************************************************/
WORD32 Rcc_Get_PCLK1(void);

/**************************************************************************
* Function: WORD32 Rcc_Get_PCLK2(void)
* Descrip.: Get PCLK2 in Hz
* Input   : None
* Output  : None
* Return  : WORD32 PCLK2 in Hz
* Note    £ºNone
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/08/01       V1.0         Ian          Create 
**************************************************************************/
WORD32 Rcc_Get_PCLK2(void);


#ifdef __cplusplus
}
#endif

#endif /* _RCC_H_ */



